Tekla.Structures.ModelInternal.RebarShapeRecognitionData
The rebar shape recognition data class.

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.IsReversed
Indicates whether the bar is reversed.

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.HasStartHook
Indicates whether the bar has a start hook.

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.HasEndHook
Indicates whether the bar has an end hook.

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.NumberOfLegs
The number of rebar legs.

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.NumberOfBendings
The number of rebar bendings.

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.ArcInnerRadius
The arc inner radius (rule operand, RI).

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.ArcOuterRadius
The arc outer radius (rule operand, RO).

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.StartHookLengthA
Start hook length A (rule operand, SHLA).

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.EndHookLengthA
End hook length A (rule operand, EHLA).

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.StartHookAngle
The start hook angle (rule operand, SHA).

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.EndHookAngle
The end hook angle (rule operand, EHA).

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.SpiralTotalLength
The spiral total length (rule operand, STL).

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.ArcLength
The arc length (rule operand, AL).

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.LegLengths
The rebar leg lengths.

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.BendingRadii
The bending radii (rule operands, R1, R2, etc).

Tekla.Structures.ModelInternal.RebarShapeRecognitionData.BendingAngles
The bending angles (rule operands, A1, A2, etc).